---
kind: other
id: Properties.T:Autodesk.Revit.UI.DockablePaneState
source: html/ddd6908e-cb5c-fc3f-bbdb-5a186a6fbe39.htm
---
# DockablePaneState Properties

Which part of the Revit application frame the pane should dock to.